In [49]:
# classifying survivors based on Pclass, Sex, Age and Fare
# splitting the data into 80 and 20 annd using for training and testing respectively

import pandas as pd
df = pd.read_csv("titanic_train.csv")
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis = "columns", inplace = True)
df.head()
x = df.drop("Survived", axis = "columns")
y = df["Survived"]

In [50]:
# Sex column has categorical values, converting it to numbers
# from sklearn.preprocessing import LabelEncoder

# le_sex = LabelEncoder()
# x["Sex"] = le_sex.fit_transform(x["Sex"])

# Alternatively we can map male and female with 1 and 2 respectively
x.Sex = x.Sex.map({'male': 1, 'female': 2})

In [51]:
# Checking for NAN values
x[x.Age.isna() == True]

     Pclass  Sex  Age     Fare
5         3    1  NaN   8.4583
17        2    1  NaN  13.0000
19        3    2  NaN   7.2250
26        3    1  NaN   7.2250
28        3    2  NaN   7.8792
..      ...  ...  ...      ...
859       3    1  NaN   7.2292
863       3    2  NaN  69.5500
868       3    1  NaN   9.5000
878       3    1  NaN   7.8958
888       3    2  NaN  23.4500

[177 rows x 4 columns]

In [52]:
# replacing NAN values in Age column with the mean
x.Age = x.Age.fillna(x.Age.mean())

In [24]:
x[x.Age.isna() == True] # all NAN values are gone

Empty DataFrame
Columns: [Pclass, Sex, Age, Fare]
Index: []

In [86]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size = 0.2)

     Pclass  Sex        Age      Fare
103       3    1  33.000000    8.6542
621       1    1  42.000000   52.5542
117       2    1  29.000000   21.0000
689       1    2  15.000000  211.3375
218       1    2  32.000000   76.2917
..      ...  ...        ...       ...
111       3    2  14.500000   14.4542
89        3    1  24.000000    8.0500
8         3    2  27.000000   11.1333
324       3    1  29.699118   69.5500
257       1    2  30.000000   86.5000

[179 rows x 4 columns]

In [26]:
len(X_train)

712

In [27]:
len(X_test)

179

In [89]:
from sklearn import tree
titanic_model = tree.DecisionTreeClassifier(criterion='gini')
titanic_model.fit(X_train, Y_train)
titanic_model.score(X_test, Y_test)

0.7374301675977654

In [117]:
# using entire training set for training and test set from kaggle for testing
titanic_model_new = tree.DecisionTreeClassifier(criterion='gini')
titanic_model_new.fit(x, y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [118]:
# loading the test set
test_df = pd.read_csv(r"C:\Users\dell\Desktop\my_codes_23_05_21\decision_tree\titanic_test.csv")
test_df.head()
test_df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis = "columns", inplace = True)
test_df.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [119]:
# encode the Sex column
test_df.Sex = test_df.Sex.map({"male":1, "female":2})
test_df.head()

# checking for NAN values in Age column
test_df[test_df.Age.isna() == True]

# replacing NAN values by mean
test_df.Age = test_df.Age.fillna(test_df.Age.mean())
test_df

# checking for NAN values in Fare column
test_df[test_df.Fare.isna() == True]
test_df.Fare = test_df.Fare.fillna(test_df.Fare.mean())

In [120]:
# predicting the labels for test data
import numpy as np
titanic_model_new.predict(test_df)

array([0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)